#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudtrail.candidate_test will be created
  + resource "aws_cloudtrail" "candidate_test" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = false
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = false
      + is_multi_region_trail         = false
      + is_organization_trail         = false
      + name                          = "lw-trail-candidate-test-vlad-senko"
      + s3_bucket_name                = (known after apply)
    }

  # aws_codecommit_repository.candidate will be created
  + resource "aws_codecommit_repository" "candidate" {
      + arn             = (known after apply)
      + clone_url_http  = (known after apply)
      + clone_url_ssh   = (known after apply)
      + description     = "Lifeworks devops test for vlad-senko"
      + id              = (known after apply)
      + repository_id   = (known after apply)
      + repository_name = "lw-candidate-test-vlad-senko"
    }

  # aws_iam_user.candidate will be created
  + resource "aws_iam_user" "candidate" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "vlad-senko"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # aws_iam_user_login_profile.candidate will be created
  + resource "aws_iam_user_login_profile" "candidate" {
      + encrypted_password      = (known after apply)
      + id                      = (known after apply)
      + key_fingerprint         = (known after apply)
      + password_length         = 20
      + password_reset_required = false
      + pgp_key                 = "mQENBFzAercBCACr2UtKuFh+NvdvW64/yeYHHaLXNzVG089tlClUHld31Ab/w6xWYcADq0zPrnYYIz9w3MJIwbxr+CXTtywNkdbRjVMyp5odrFNXUVg5mXIVkmI7IZz7KsDSY+JhztbGlpTcgw3r0DU29KtiyPk8uj0sZcZNu+oTGpDa+b3/+SklEdwMQ1AwKIxYe1qyBLnKRMCN84D5SyJHXxqcvCv7wPwtaFvsBJ8MmXAMOU/j0sg2ziMMpA/wEfPLXK3ZkDOQgpghUZjR95olChMGaej98UXmO6gOcSMuktjfI0huSvAHQYDNMNxYQXszvtUi3JhHElItSVPAck5YjSTxfwQCu9ytABEBAAG0K0xpZmV3b3JrcyBEZXZvcHMgVGVzdCA8aW5mcmFAbGlmZXdvcmtzLmNvbT6JAVQEEwEIAD4WIQQElsrDagAb4qZ5RsMAZldXMTnjHgUCXMB6twIbAwUJA8JnAAULCQgHAgYVCgkICwIEFgIDAQIeAQIXgAAKCRAAZldXMTnjHn7NB/9Qf56wUM3F1i22rc4BrpdNQUobD61EgVSDY9I0Lv+BaUbSGsAc0MAw1gnGiNGuMR7qhjExunDWrp8nyySgVuPrmRaF7q/hFD9fm4DTrfN90I5Gd2LDxxmhud2xAwTDCJmvz3CDRDATN6ECRcMTv24Yp4jzdH6NSeN1O+rdCPMp43YX3zoQqtpMC/TS7IiIkx5xAuV8u/MQlNDMCRUmDOyqHgjaNtF8m2Gq+uiRAF+TFlWKJWnuyi8Zixxj4JMKyUxDZm4epXCOquhiSgUPY44cJEgrYZEM8A3V27nS7nmO0kia9Md88g4FXrbmJOIYQ4xBmsJGu+Sm1I4NxFgwIgh0uQENBFzAercBCAC+3ASfAdNDd5Ay7u5nRCxm6t8OIr6hRtDDjFIJhnd4uqiWmtyQmv/CGaXu4/xybofoBEvM0N8ZYByV5Ya6uN1B2lH0kJypiTwFqPEIssIODDTSsyfGEhbp+76iLeLrVtYj6wGadFa43P4jfoHI6XXFIX7fkyvlcIsLb4eGEbphTAP4cUu8KPLsD0AQb+cqycRP848G8oTo7GFana09zq37JbmFnM8aCyD75iQzKPTAoGN2rdIwjxBKpEhL86HUFTkCHhBlm0w7Insth8pfWVurScwdADHQGlaZNcqCj5CNLn6SuKydrPSbyR0/FPDP7u9yMz0qrua/UNxbMDQCrGVlABEBAAGJATwEGAEIACYWIQQElsrDagAb4qZ5RsMAZldXMTnjHgUCXMB6twIbDAUJA8JnAAAKCRAAZldXMTnjHs4xB/42QlRB2zgyv1mCBtf4Y3eLcpey6zUa9ScOP0K1ry2lxgP8dFz/TQ8YifHdMW7SQeVjmWtwbYDZ4uiqBhlytiNs0zZMYCggFA2HtkgAIWs50I2aQ6WCHC20jF53gB23ONUrzzbjdQ2wbww1yhVUQjHArCI8j67mzEUrqKDJNrPQo0VOwsUXF/QSerBFvQHQaptYt4hP8YGkmcwBkV5VNA45X09qMoDlNisP1+auamfFpG19bPFOVqsIt/zhVhxDh2+9BWsxmDJ8FMsk79cPCKrYkiJTX6fEcAgokyA8weicoJNicrNqj/39BqkP5q0GTU+tzaH5tA1+eiEIRtUT3zLy"
      + user                    = "vlad-senko"
    }

  # aws_iam_user_policy_attachment.candidate will be created
  + resource "aws_iam_user_policy_attachment" "candidate" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + user       = "vlad-senko"
    }

  # aws_s3_bucket.lw_cloudtrail_candidate_test will be created
  + resource "aws_s3_bucket" "lw_cloudtrail_candidate_test" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "lw-cloudtrail-candidate-test-vlad-senko"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + policy                      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::lw-cloudtrail-candidate-test-vlad-senko"
                      + Sid       = "AWSCloudTrailAclCheck"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::lw-cloudtrail-candidate-test-vlad-senko/*"
                      + Sid       = "AWSCloudTrailWrite"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.ecs.aws_autoscaling_group.autoscaling will be created
  + resource "aws_autoscaling_group" "autoscaling" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "ecs-cluster-vlad-senko-candidate-test-autoscaling"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }
    }

  # module.ecs.aws_ecs_cluster.cluster will be created
  + resource "aws_ecs_cluster" "cluster" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "vlad-senko-candidate-test"

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.demo_ecs_service will be created
  + resource "aws_ecs_service" "demo_ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "test-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)

      + load_balancer {
          + container_name   = "test-container"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + placement_strategy {
          + field = (known after apply)
          + type  = (known after apply)
        }
    }

  # module.ecs.aws_ecs_task_definition.test_task_def will be created
  + resource "aws_ecs_task_definition" "test_task_def" {
      + arn                   = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + image             = "sum41k/test-apache"
                  + memory            = 128
                  + memoryReservation = 128
                  + name              = "test-container"
                  + portMappings      = [
                      + {
                          + containerPort = 80
                          + hostPort      = 0
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + family                = "test-service"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
    }

  # module.ecs.aws_iam_instance_profile.ecs_host will be created
  + resource "aws_iam_instance_profile" "ecs_host" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ecs-host-vlad-senko-candidate-test"
      + path        = "/"
      + role        = (known after apply)
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.ecs.aws_iam_role.ecs_host will be created
  + resource "aws_iam_role" "ecs_host" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "ecs.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vlad-senko-candidate-test-ecs-host"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.ecs.aws_iam_role_policy_attachment.ecs_ec2_cloudwatch_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_ec2_cloudwatch_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLogsFullAccess"
      + role       = (known after apply)
    }

  # module.ecs.aws_iam_role_policy_attachment.ecs_ec2_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_ec2_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = (known after apply)
    }

  # module.ecs.aws_launch_template.ecs_host will be created
  + resource "aws_launch_template" "ecs_host" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-0c76718bab08843b7"
      + instance_type   = "t2.micro"
      + key_name        = "test-sum41k"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "ecs-cluster-vlad-senko-candidate-test-launch-configuration"
      + user_data       = "IyEvYmluL2Jhc2gKZWNobyBFQ1NfQ0xVU1RFUj0ndmxhZC1zZW5rby1jYW5kaWRhdGUtdGVzdCcgPiAvZXRjL2Vjcy9lY3MuY29uZmlnCg=="

      + block_device_mappings {
          + device_name = "/dev/xvdcz"

          + ebs {
              + iops        = (known after apply)
              + volume_size = 30
              + volume_type = "standard"
            }
        }

      + iam_instance_profile {
          + name = "ecs-host-vlad-senko-candidate-test"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = true
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "ecs-host-vlad-senko-candidate-test"
            }
        }
    }

  # module.ecs.aws_security_group.alb_sg will be created
  + resource "aws_security_group" "alb_sg" {
      + arn                    = (known after apply)
      + description            = "SG for ALB purposes"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "vlad-senko-candidate-test-alb_sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_security_group.ecs_cluster_sg will be created
  + resource "aws_security_group" "ecs_cluster_sg" {
      + arn                    = (known after apply)
      + description            = "ECS default security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "vlad-senko-candidate-test-role-ecs-host"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_security_group.test_web-asg will be created
  + resource "aws_security_group" "test_web-asg" {
      + arn                    = (known after apply)
      + description            = "SG for ASG purposes"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "vlad-senko-candidate-test-web-asg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_security_group_rule.allow_ecs_egress will be created
  + resource "aws_security_group_rule" "allow_ecs_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.ecs.aws_security_group_rule.allow_ephemeral_egress will be created
  + resource "aws_security_group_rule" "allow_ephemeral_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 32768
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.ecs.aws_security_group_rule.allow_ephemeral_ingress will be created
  + resource "aws_security_group_rule" "allow_ephemeral_ingress" {
      + from_port                = 32768
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.ecs.aws_security_group_rule.allow_http_ingress will be created
  + resource "aws_security_group_rule" "allow_http_ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.ecs.aws_security_group_rule.allow_ssh will be created
  + resource "aws_security_group_rule" "allow_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.ecs.aws_security_group_rule.asg_egress will be created
  + resource "aws_security_group_rule" "asg_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.ecs.aws_security_group_rule.asg_http_eph will be created
  + resource "aws_security_group_rule" "asg_http_eph" {
      + from_port                = 32768
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.ecs.aws_security_group_rule.default_sg_nat_ingress will be created
  + resource "aws_security_group_rule" "default_sg_nat_ingress" {
      + cidr_blocks              = (known after apply)
      + description              = "NAT Gateway"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "Environment" = "test"
          + "Managed"     = "terraform"
          + "Name"        = "main-vlad-senko-eu-west-1a"
        }
      + vpc               = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "test"
          + "Managed"     = "terraform"
          + "Name"        = "main-vlad-senko"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "test"
          + "Managed"     = "terraform"
          + "Name"        = "main-vlad-senko-eu-west-1a"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "test"
          + "Managed"     = "terraform"
          + "Name"        = "main-vlad-senko-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "test"
          + "Managed"     = "terraform"
          + "Name"        = "main-vlad-senko-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.0.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "test"
          + "Managed"     = "terraform"
          + "Name"        = "main-vlad-senko-private-eu-west-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.32.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "test"
          + "Managed"     = "terraform"
          + "Name"        = "main-vlad-senko-private-eu-west-1b"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.64.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "test"
          + "Managed"     = "terraform"
          + "Name"        = "main-vlad-senko-private-eu-west-1c"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.200.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "test"
          + "Managed"     = "terraform"
          + "Name"        = "main-vlad-senko-public-eu-west-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.201.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "test"
          + "Managed"     = "terraform"
          + "Name"        = "main-vlad-senko-public-eu-west-1b"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.202.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "test"
          + "Managed"     = "terraform"
          + "Name"        = "main-vlad-senko-public-eu-west-1c"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = false
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Environment" = "test"
          + "Managed"     = "terraform"
          + "Name"        = "main-vlad-senko"
        }
    }

  # module.ecs.module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "my-alb"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Environment" = "Test"
          + "Name"        = "my-alb"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.ecs.module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.ecs.module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "test"
      + port                               = 80
      + protocol                           = "HTTP"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "Test"
          + "Name"        = "test"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

Plan: 49 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Tflint`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
